"""
2.
```
>>> L = [ ['田中', '山下', '中村', '村上', '江口'], [35, 69, 21, 12, 46]]
>>> sorted(L)
[ ['村上', '中村', '田中', '江口', '山下'], [12, 21, 35, 46, 69]]
```

となるような２次元配列の並び替えを行う関数sortedを実装してください
Lは
```
[ ['田中', '山下', '中村', '村上', '江口'],
  [    35,    69,     21,     12,    46]]
```
というふうに名前と年齢が一対一で対応したものです。
"""
def sorted(L):
    dic={}
    n=0
    for i in L[1]:
        dic[i]=L[0][n]
        n+=1
    #return dic
#print(sorted( [ ['田中', '山下', '中村', '村上', '江口'], [35, 69, 21, 12, 46]]))
    age=L[1]
    for i in range(1,len(age)):
        j = i
        while (j > 0) and (age[j-1] > age[j]) :
            tmp = age[j-1]
            age[j-1] = age[j]
            age[j] = tmp
            j -= 1
    n=0
    for i in age:
        L[0][n]=dic[i]
        n+=1
    return L

print(sorted( [ ['田中', '山下', '中村', '村上', '江口'], [35, 69, 21, 12, 46]]))
